# Pandas Data Structure

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

## Series

In [3]:
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2['d']=6

In [12]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[['c','b','a']]

c    3
b    7
a   -5
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'ohio': 35000, 'Texas': 71000, 'oregon': 16000, 'utah': 5000}

In [20]:
obj3 = Series(sdata)

In [21]:
obj3

ohio      35000
Texas     71000
oregon    16000
utah       5000
dtype: int64

In [22]:
states = ['california', 'ohio', 'oregon', 'Texas']
obj4 = Series(sdata, index=states)

In [23]:
obj4

california        NaN
ohio          35000.0
oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

california     True
ohio          False
oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
Texas          True
dtype: bool

In [26]:
#also as instance method
obj4.isnull()

california     True
ohio          False
oregon        False
Texas         False
dtype: bool

In [27]:
obj3 + obj4

Texas         142000.0
california         NaN
ohio           70000.0
oregon         32000.0
utah               NaN
dtype: float64

In [28]:
obj4.name = 'population'

In [29]:
obj4.index.name = 'state'

In [30]:
obj4

state
california        NaN
ohio          35000.0
oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj.index = ['bob', 'steve', 'jeff', 'ryan']

In [32]:
obj

bob      4
steve    7
jeff    -5
ryan     3
dtype: int64

## DataFrame

In [33]:
data = {'state': ['ohio','ohio','ohio','nevada','nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [34]:
frame = DataFrame(data)

In [35]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [36]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9

In [37]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'])

In [38]:
frame2

   year   state  pop debt
0  2000    ohio  1.5  NaN
1  2001    ohio  1.7  NaN
2  2002    ohio  3.6  NaN
3  2001  nevada  2.4  NaN
4  2002  nevada  2.9  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
frame2['state']

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
Name: state, dtype: object

In [41]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [42]:
frame2.loc[3]

year       2001
state    nevada
pop         2.4
debt        NaN
Name: 3, dtype: object

In [43]:
frame2['debt'] = 16.5

In [44]:
frame2

   year   state  pop  debt
0  2000    ohio  1.5  16.5
1  2001    ohio  1.7  16.5
2  2002    ohio  3.6  16.5
3  2001  nevada  2.4  16.5
4  2002  nevada  2.9  16.5

In [45]:
val = Series([-1.2, -1.5, -1.7], index=[1,3,4])

In [46]:
frame2['debt'] = val

In [47]:
frame2

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.7  -1.2
2  2002    ohio  3.6   NaN
3  2001  nevada  2.4  -1.5
4  2002  nevada  2.9  -1.7

In [48]:
frame2['eastern'] = frame2.state=='ohio'

In [49]:
frame2

   year   state  pop  debt  eastern
0  2000    ohio  1.5   NaN     True
1  2001    ohio  1.7  -1.2     True
2  2002    ohio  3.6   NaN     True
3  2001  nevada  2.4  -1.5    False
4  2002  nevada  2.9  -1.7    False

In [50]:
del frame2['eastern']

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
pop = {'nevada': {2001: 2.4, 2002: 2.9},
      'ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [53]:
frame3 = DataFrame(pop)

In [54]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [55]:
frame3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [56]:
pdata = {'ohio': frame3['ohio'][:1],
        'nevada': frame3['nevada'][:2]}

In [57]:
DataFrame(pdata)

      ohio  nevada
2001   1.7     2.4
2002   NaN     2.9

In [58]:
frame3.index.name = 'years'
frame3.columns.name = 'state'

In [59]:
frame3

state  nevada  ohio
years
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [60]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

## Index Objects

In [61]:
obj = Series(range(3), index=['a','b','c'])

In [62]:
index = obj.index

In [63]:
index[1:]

Index(['b', 'c'], dtype='object')

# Essential Functionality

## Reindexing

In [64]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])

In [65]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [66]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [67]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [68]:
obj.reindex(['a','b','c','d','e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [69]:
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])

In [70]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [71]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['ohio','Texas','California'])

In [72]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

## Dropping entries from an axis

In [73]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])

In [74]:
new_obj = obj.drop('c')

In [75]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [76]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [77]:
frame.drop('ohio', axis=1)

   Texas  California
a      1           2
c      4           5
d      7           8

## Indexing, selection, and filtering

In [78]:
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [79]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [80]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [81]:
obj[['a','b']]

a    0.0
b    1.0
dtype: float64

In [82]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [83]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [84]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [85]:
obj['b':'c'] = 5

In [86]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [87]:
frame[frame<5]

   ohio  Texas  California
a   0.0    1.0         2.0
c   3.0    4.0         NaN
d   NaN    NaN         NaN

In [88]:
frame<5

    ohio  Texas  California
a   True   True        True
c   True   True       False
d  False  False       False

## Arithmetic and data alignment

In [89]:
 s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])

In [90]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f','g'])

In [91]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [92]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [93]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [94]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

In [95]:
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [96]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [97]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [98]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [99]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

## Mapping

In [100]:
format = lambda x: '%.2f' % x

In [101]:
frame.applymap(format)

   ohio Texas California
a  0.00  1.00       2.00
c  3.00  4.00       5.00
d  6.00  7.00       8.00

## sorting and ranking

In [102]:
obj.sort_index()

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [103]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [104]:
frame.sort_index(axis=1, ascending=False)

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [106]:
obj = Series(range(5), index=['a','a','b','b','c'])

In [107]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [108]:
obj.index.is_unique

False

In [109]:
obj['a']

a    0
a    1
dtype: int64